In [1]:
d=[['a',1],['b',2],['c',3]]

In [4]:
import pandas as pd

In [12]:
ab=pd.DataFrame(d, columns=['String','Integer'])

In [14]:
ab

  String  Integer
0      a        1
1      b        2
2      c        3

In [25]:
a=pd.DataFrame(d,index=['First','Second','Third'],columns=['Word','Count'])

In [26]:
a

       Word  Count
First     a      1
Second    b      2
Third     c      3

In [27]:
a[2:]

      Word  Count
Third    c      3

In [30]:
a[1:2]

       Word  Count
Second    b      2

In [31]:
EMP={'Emp_id':[111,112,113,114],'Empname':['Ravi','Ria','Jaya','Siya'],'Qualification':['MSC','BA','MBA','Msc']}

In [32]:
EMP

{'Emp_id': [111, 112, 113, 114],
 'Empname': ['Ravi', 'Ria', 'Jaya', 'Siya'],
 'Qualification': ['MSC', 'BA', 'MBA', 'Msc']}

In [33]:
df=pd.DataFrame(EMP)

In [35]:
Emp_address=['Hydrabad','Delhi','Udisa','Vijaywada']

In [38]:
df['address']=Emp_address

In [39]:
df

   Emp_id Empname Qualification    address
0     111    Ravi           MSC   Hydrabad
1     112     Ria            BA      Delhi
2     113    Jaya           MBA      Udisa
3     114    Siya           Msc  Vijaywada